Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.0.10/samha1ab/atdf/ATSAMHA1G16AB.atdf
        <module name="FUSES" id="U2207" version="2.0.2">
          <instance name="FUSES">
            <register-group name="AUX3_FUSES" name-in-module="AUX3_FUSES" address-space="fuses" offset="0x0080A000"/>
            <register-group name="OTP4_FUSES" name-in-module="OTP4_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="PAC" id="U2211" version="1.0.1">
          <instance name="PAC0">
            <register-group name="PAC0" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000000" caption="PAC protection mask at reset"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
          <instance name="PAC1">
            <register-group name="PAC1" name-in-module="PAC" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000002" caption="PAC protection mask at reset"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
          <instance name="PAC2">
            <register-group name="PAC2" name-in-module="PAC" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00800000" caption="PAC protection mask at reset"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2206" version="2.1.2">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="CTRL_MCSEL_DFLL48M" value="3"/>
              <param name="CTRL_MCSEL_GCLK" value="0"/>
              <param name="CTRL_MCSEL_OSC8M" value="1"/>
              <param name="CTRL_MCSEL_XOSC" value="2"/>
              <param name="PM_CLK_APB_NUM" value="2"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="NVMCTRL" bit="4"/>
                <clock name="DMAC" bit="5"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="1.0.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41004400"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="62" function="default" pad="PB30"/>
            </signals>
            <parameters>
              <param name="BITS" value="64" caption="Number of PORT pins"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported"/>
              <param name="GROUPS" value="2" caption="Number of 32-bit PORT groups"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
