Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.0.10/samha1ab/atdf/ATSAMHA1G16AB.atdf
        <module name="TC" id="U2212" version="1.3.1">
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="24" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="25" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="26" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="27" caption="Index of Generic Clock"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42003000"/>
            <signals>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="27" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="28" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="29" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB10"/>
              <signal group="WO" index="0" function="E" pad="PA27"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PA28"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="30" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="21" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="32" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="0" function="E" pad="PA02"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="33" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="34" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="35" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x42003C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PB22"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
              <signal group="WO" index="1" function="E" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2" caption="Number of 8-bit Counters"/>
              <param name="CC16_NUM" value="2" caption="Number of 16-bit Counters"/>
              <param name="CC32_NUM" value="2" caption="Number of 32-bit Counters"/>
              <param name="DITHERING_EXT" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="36" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="37" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="38" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PERIOD_EXT" value="0" caption="Period feature implemented"/>
              <param name="SHADOW_EXT" value="0" caption="Shadow feature implemented"/>
              <param name="INSTANCE_ID" value="79"/>
            </parameters>
          </instance>
        </module>
